faronov/efr32mg1p-zigbee-sensor/app.c
  APP_DEBUG_PRINTF("SPI flash: JEDEC ID %02X %02X %02X (%s)\n",
                   rx[1],
                   rx[2],
                   rx[3],
                   label);

  tx[0] = 0x05; // Read Status Register-1
  memset(rx, 0, sizeof(rx));
  GPIO_PinOutClear(port, pin);
  status = SPIDRV_MTransferB(sl_spidrv_exp_handle, tx, rx, 2);
  GPIO_PinOutSet(port, pin);
  if (status == ECODE_OK) {
    APP_DEBUG_PRINTF("SPI flash: SR1=0x%02X (%s)\n", rx[1], label);
  }

  tx[0] = 0x35; // Read Status Register-2
  memset(rx, 0, sizeof(rx));
  GPIO_PinOutClear(port, pin);
  status = SPIDRV_MTransferB(sl_spidrv_exp_handle, tx, rx, 2);
  GPIO_PinOutSet(port, pin);
  if (status == ECODE_OK) {
    APP_DEBUG_PRINTF("SPI flash: SR2=0x%02X (%s)\n", rx[1], label);
  }

  return !((rx[1] == 0x00 && rx[2] == 0x00 && rx[3] == 0x00)
           || (rx[1] == 0xFF && rx[2] == 0xFF && rx[3] == 0xFF));
}

static void app_flash_config_usart(USART_ClockMode_TypeDef mode,
                                   uint32_t baudrate,
                                   uint32_t tx_loc,
                                   uint32_t rx_loc,
                                   uint32_t clk_loc)
{
  static bool clocked = false;
  if (!clocked) {
    CMU_ClockEnable(cmuClock_HFPER, true);
    CMU_ClockEnable(cmuClock_USART1, true);
    GPIO_PinModeSet(gpioPortD, 13, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortD, 15, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortD, 14, gpioModeInputPull, 0);
    clocked = true;
  }

  USART1->ROUTELOC0 = (USART1->ROUTELOC0
                       & ~(_USART_ROUTELOC0_TXLOC_MASK
                           | _USART_ROUTELOC0_RXLOC_MASK
                           | _USART_ROUTELOC0_CLKLOC_MASK))
                      | tx_loc
                      | rx_loc
                      | clk_loc;
  USART1->ROUTEPEN = USART_ROUTEPEN_TXPEN
                     | USART_ROUTEPEN_RXPEN
                     | USART_ROUTEPEN_CLKPEN;

  USART_InitSync_TypeDef init = USART_INITSYNC_DEFAULT;
  init.baudrate = baudrate;
  init.clockMode = mode;
  init.msbf = true;
  init.master = true;
  init.autoCsEnable = false;
  USART_InitSync(USART1, &init);
  USART_Enable(USART1, usartEnable);
}
static void app_flash_bb_init(void)
{
  GPIO_PinModeSet(gpioPortD, 13, gpioModePushPull, 0); // CLK
  GPIO_PinModeSet(gpioPortD, 15, gpioModePushPull, 0); // MOSI
  GPIO_PinModeSet(gpioPortD, 14, gpioModeInput, 0);    // MISO
}

static uint8_t app_flash_bb_transfer(uint8_t out)
{
  uint8_t in = 0;
  for (int bit = 7; bit >= 0; bit--) {
    if (out & (1u << bit)) {
      GPIO_PinOutSet(gpioPortD, 15);
    } else {
      GPIO_PinOutClear(gpioPortD, 15);
    }

    // Small delay to meet setup time.
    for (volatile int d = 0; d < 20; d++) {
      __NOP();
    }

    GPIO_PinOutSet(gpioPortD, 13);
    if (GPIO_PinInGet(gpioPortD, 14)) {
      in |= (1u << bit);
    }

    for (volatile int d = 0; d < 20; d++) {
      __NOP();
    }

    GPIO_PinOutClear(gpioPortD, 13);
  }
  return in;
}

static void app_flash_probe_bitbang(GPIO_Port_TypeDef port,
                                    unsigned int pin,
                                    const char *label)
{
  app_flash_enable_init();
  app_flash_bb_init();
  GPIO_PinModeSet(port, pin, gpioModePushPull, 1);

  GPIO_PinOutClear(port, pin);
  (void)app_flash_bb_transfer(0x9F);
  uint8_t b0 = app_flash_bb_transfer(0x00);
  uint8_t b1 = app_flash_bb_transfer(0x00);
  uint8_t b2 = app_flash_bb_transfer(0x00);
  GPIO_PinOutSet(port, pin);

  APP_DEBUG_PRINTF("SPI flash (bitbang): JEDEC ID %02X %02X %02X (%s)\n",
                   b0,
                   b1,
                   b2,
                   label);
}

static void app_flash_probe_usart(GPIO_Port_TypeDef port,
                                  unsigned int pin,
                                  const char *label)
{
  app_flash_config_usart(usartClockMode0,
                         500000,
                         _USART_ROUTELOC0_TXLOC_LOC23,
                         _USART_ROUTELOC0_RXLOC_LOC21,
                         _USART_ROUTELOC0_CLKLOC_LOC19);
  app_flash_read_jedec_usart(port, pin, label, "tx23/rx21");

  app_flash_config_usart(usartClockMode0,
                         500000,
                         _USART_ROUTELOC0_TXLOC_LOC21,
                         _USART_ROUTELOC0_RXLOC_LOC23,
                         _USART_ROUTELOC0_CLKLOC_LOC19);
  app_flash_read_jedec_usart(port, pin, label, "tx21/rx23");
}

static void app_flash_read_jedec_usart(GPIO_Port_TypeDef port,
                                       unsigned int pin,
                                       const char *label,
                                       const char *route_tag)
{
  app_flash_enable_init();
  GPIO_PinModeSet(port, pin, gpioModePushPull, 1);

  GPIO_PinOutClear(port, pin);
  (void)USART_SpiTransfer(USART1, 0x9F);
  uint8_t b0 = USART_SpiTransfer(USART1, 0x00);
  uint8_t b1 = USART_SpiTransfer(USART1, 0x00);
  uint8_t b2 = USART_SpiTransfer(USART1, 0x00);
  GPIO_PinOutSet(port, pin);

  APP_DEBUG_PRINTF("SPI flash (usart1 %s): JEDEC ID %02X %02X %02X (%s)\n",
                   route_tag,
                   b0,
                   b1,
                   b2,
                   label);
}


/**
 * @brief Network join success callback
 *
 * Called when the device successfully joins a Zigbee network.
 */
void emberAfStackStatusCallback(EmberStatus status)
{
#if APP_DEBUG_SPI_ONLY
  (void)status;
  return;
#endif
  APP_DEBUG_PRINTF("Stack status: 0x%02x\n", status);
  if (status == EMBER_NETWORK_UP) {
    emberAfCorePrintln("Network joined successfully");

    // Reset join attempt counter and scan state on success
    join_attempt_count = 0;
    current_channel_index = 0;
    network_join_in_progress = false;
    join_scan_in_progress = false;
    join_network_found = false;

    // Cancel any pending rejoin attempts - network is up (TEMPORARILY DISABLED)
    // rejoin_state = REJOIN_STATE_DONE;
    // sl_zigbee_event_set_inactive(&rejoin_retry_event);

    // Stop LED blinking
    led_blink_active = false;
    sl_zigbee_event_set_inactive(&led_blink_event);

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Turn LED on solid to indicate network is up
    sl_led_turn_on(&sl_led_led0);

